{
    "lastmod": "2025-6-10",
    "url": "preparations/creams",
    "entity_slug": "creams",
    "entity_name_singular": "cream",
    "entity_name_plural": "creams",
    "title": "What to know about creams for medicinal use?",
    "intro": "Creams are semi-solid preparations made by combining oils, water, and emulsifying agents to create a smooth, spreadable texture. In herbalism, creams are used to deliver medicinal herbs directly to the skin, allowing for localized treatment of conditions like inflammation, eczema, and muscle pain. They often contain extracts of herbs such as calendula, chamomile, or lavender, which have soothing and healing properties. The formulation helps to enhance the absorption of active herbal compounds through the skin. Creams are a versatile and effective method of applying herbal remedies for topical health concerns.",
    "best": "Some of the best herbal creams for medicinal purposes are Zingiber officinale, Glycyrrhiza glabra, Lavandula angustifolia, Echinacea purpurea, and Curcuma longa. Zingiber officinale, or ginger, is known for its anti-inflammatory and pain-relieving properties. Glycyrrhiza glabra, or licorice root, has soothing and antimicrobial effects that help with skin irritation. Lavandula angustifolia, or lavender, is prized for its calming and healing properties that promote skin recovery. Echinacea purpurea boosts the immune system and reduces inflammation, making it ideal for topical use. Curcuma longa, or turmeric, contains curcumin, a powerful antioxidant that reduces inflammation and promotes skin health.",
    "what": "Creams are semi-solid preparations made by combining herbal extracts with a base of water, oil, or emulsifiers, often used for topical application. Unlike tinctures, which are liquid extracts in alcohol, or salves, which are thicker and often contain more oils, creams have a lighter consistency and are easier to spread on the skin. They are particularly effective for delivering herbal compounds to the skin's surface without the drying effects of alcohol. Creams are ideal for moisturizing and treating minor skin conditions, offering a gentle and accessible alternative to more potent herbal formulations. Overall, they provide a balanced mix of efficacy and user-friendliness, making them a popular choice for everyday skincare and minor therapeutic use.",
    "how_it_works": "Creams work by delivering active herbal compounds through the skin via emulsification, where water-soluble and oil-soluble ingredients are combined into a stable base that can penetrate the epidermis. The preparation often involves extraction methods such as maceration, infusion, or alcohol-based solvent extraction to dissolve the active constituents from the plant material. These methods rely on solubility principles, where different solvents extract specific compounds based on their chemical properties. Common active constituents include essential oils, flavonoids, alkaloids, and tannins, which have anti-inflammatory, antimicrobial, or analgesic properties. Once absorbed through the skin, these compounds are delivered directly to the site of application, enhancing local potency and reducing systemic side effects."
}
